Repository: goodbaes/localization_ui_tool
Catalog: lib/l10n/arb/app_*.arb
Languages: es, ru

# appTitle
source: Localization UI Tools
es: Herramienta de UI de
ru: Инструмент локализации UI

source: Search
es: Buscara
ru: Поиск

source: Error loading entries
es: Error al cargar entradas
ru: Ошибка загрузки записей

# editEntry
source: Edit {entryKey}
es: Editar {entryKey}
ru: Редактировать {entryKey}

source: Saving...
es: Guardando...
ru: Сохранение...

source: Missing Translations
es: Traducciones faltantes
ru: Отсутствующие переводы

# noMissingTranslations
source: No missing translations found.
es: No se encontraron traducciones faltantes.
ru: Отсутствующие переводы не найдены.

# addEntry
source: Add New Entry
es: Añadir nueva entrada
ru: Добавить новую запись

source: Key
es: Clave
ru: Ключ

source: Translation
es: Traducción
ru: Перевод

source: Key cannot be empty
es: La clave no puede estar vacía
ru: Ключ не может быть пустым

source: New Key
es: Nueva clave
ru: Новый ключ

source: Add
es: Añadir
ru: Добавить

# sessionAddedKeys
source: Keys added in this session
es: Claves añadidas en esta sesión
ru: Ключи, добавленные в этой сессии

# keyExists
source: Key already exists
es: La clave ya existe
ru: Ключ уже существует

# title_onboarding
source: hello
es: holla
ru: привет

source: start
ru: начать

source: Settings
es: Ajustes
ru: Настройки

source: ARB Directory
es: Directorio ARB
ru: Директория ARB

source: Not set
es: No establecido
ru: Не установлено

source: Error
ru: Ошибка

source: OK
ru: ОК

# keyInvalidCharacters
source: Key can only contain characters and underscores.
es: La clave solo puede contener caracteres y guiones bajos.
ru: Ключ может содержать только символы и подчеркивания.

source: Translation cannot be empty.
es: La traducción no puede estar vacía.
ru: Перевод не может быть пустым.

# keyCannotStartWithAt
source: Key cannot start with "@".
es: La clave no puede empezar con "@".
ru: Ключ не может начинаться с "@".

source: Language
es: Idioma
ru: Язык

source: Key cannot contain digits.
es: La clave no puede contener dígitos.
ru: Ключ не может содержать цифры.

# noArbFilesFound
source: No .arb files found in the selected directory.
es: No se encontraron archivos .arb en el directorio seleccionado.
ru: В выбранной директории не найдено файлов .arb.

# macOSPermissionErrorTitle
source: macOS Permission Error
es: Error de Permisos en macOS
ru: Ошибка разрешений macOS

# macOSPermissionErrorExplanation
source: It seems like the application doesn't have the necessary permissions to access the selected directory on macOS. Please follow these steps to grant Full Disk Access:
es: Parece que la aplicación no tiene los permisos necesarios para acceder al directorio seleccionado en macOS. Siga estos pasos para otorgar Acceso Total al Disco:
ru: Похоже, у приложения нет необходимых разрешений для доступа к выбранной директории в macOS. Пожалуйста, выполните следующие шаги, чтобы предоставить полный доступ к диску:

# macOSPermissionErrorStepOne
source: 1. Close the application.
es: 1. Cierre la aplicación.
ru: 1. Закройте приложение.

# macOSPermissionErrorStepTwo
source: 2. Go to System Settings (or System Preferences) on your Mac.
es: 2. Vaya a Configuración del Sistema (o Preferencias del Sistema) en su Mac.
ru: 2. Перейдите в Системные настройки (или Системные параметры) на вашем Mac.

# macOSPermissionErrorStepThree
source: 3. Select Privacy & Security.
es: 3. Seleccione Privacidad y Seguridad.
ru: 3. Выберите Конфиденциальность и безопасность.

# macOSPermissionErrorStepFour
source: 4. Scroll down and find Full Disk Access.
es: 4. Desplácese hacia abajo y busque Acceso Total al Disco.
ru: 4. Прокрутите вниз и найдите Полный доступ к диску.

# macOSPermissionErrorStepFive
source: 5. Click the lock icon to unlock settings and enter your administrator password.
es: 5. Haga clic en el icono de candado para desbloquear la configuración e ingrese su contraseña de administrador.
ru: 5. Нажмите на значок замка, чтобы разблокировать настройки, и введите свой пароль администратора.

# macOSPermissionErrorStepSix
source: 6. Click the '+' button to add a new application.
es: 6. Haga clic en el botón '+' para agregar una nueva aplicación.
ru: 6. Нажмите кнопку '+', чтобы добавить новое приложение.

# macOSPermissionErrorStepSeven
source: 7. Navigate to your application (usually in build/macos/Build/Products/Debug/ or Release/ inside your project folder) and select it.
es: 7. Navegue hasta su aplicación (generalmente en build/macos/Build/Products/Debug/ o Release/ dentro de la carpeta de su proyecto) y selecciónela.
ru: 7. Найдите свое приложение (обычно в build/macos/Build/Products/Debug/ или Release/ внутри папки вашего проекта) и выберите его.

# macOSPermissionErrorStepEight
source: 8. Ensure the toggle next to your application is turned on (blue).
es: 8. Asegúrese de que el interruptor junto a su aplicación esté activado (azul).
ru: 8. Убедитесь, что переключатель рядом с вашим приложением включен (синий).

# macOSPermissionErrorButton
source: Show Instructions
es: Mostrar Instrucciones
ru: Показать инструкции

source: test
es: testnn
ru: тест

source: Theme
es: Tema
ru: Тема

# qwe
source: qwee
es: qwerr

# qq
source: q
es: a
